tutorials/multiphaseTransport/interTransportFoam/channelMultiphaseTransport/system/controlDictInit
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interTransportFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2.5e-3;

deltaT          1e-8;

writeControl    adjustable;

writeInterval   1e-4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;
maxAlphaCo      0.2;

maxDeltaT       1e-7; 

libs ("libfiniteVolumeGCFOAM.so""libreactionThermophysicalModelsGCFOAM.so");

// ************************************************************************* //
