tutorials/multiphaseTransport/interTransportFoam/channelMultiphaseTransport/system/blockMeshDict2D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices        
(
    (0 0 0)//0
    (dx 0 0)//1
    (dx dy 0)//2
    (0 dy 0)//3
    (0 0 1e-6)//4
    (dx 0 1e-6)//5
    (dx dy 1e-6)//6
    (0 dy 1e-6)//7
);

blocks          
(
        hex (0 1 2 3 4 5 6 7) (nx ny 1) simpleGrading 
	(
	1
        (	
	    grading
	)
        1
	)
);

edges           
(
);

boundary
(
    top 
    {
        type symmetryPlane;
        faces
        (
	    (3 7 6 2)
	);
    }

    bottom
    {
        type walls;
        faces
        (	
	    (0 1 5 4)
        );
    }
    inlet
    {
		type patch;
		faces
		(
	    	(0 4 7 3)
		);
    } 
    outlet
    {
		type patch;
		faces
		(
	   	(1 2 6 5)
		);
    }
    frontandback
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
